<?php
$array =[]; //для хранения чисел фибоначчи
$n_1 = 0;// Начальные числа
$n_2 = 1;
$n_L = 64; // колличество чисел
$n_n = $n_1 + $n_2;
for($i = 0; $i <= $n_L-3; $i++)
{
	$n_n = $n_1 + $n_2;// находим следующее число
	
	if($i == 0) // заносим числа в массив
	{
		$array[] =$n_1;
		$array[] =$n_2;
	}
	
	$n_1 = $n_2; // обновляем переменные
	$n_2 = $n_n;
	
	$array[] =$n_n;// заносим число в массив
}

$table = '<table border="1">'; // печатаем таблицу
$table .= '<tr><th>Число</th><th>Значение</th></tr>';

foreach($array as $key => $value)
{
	$k = 1+$key;
	$table .= '<tr><td>'. $k .'</td><td>'. $value .'</td></tr>';
}
	echo $table;
 
?>